blog/org-info/emacs_com/emacs_org-mode.org
#+TITLE: org-mode
#+INFOJS_OPT: path:../script/org-info.js
#+INFOJS_OPT: home:http://wcq.fun
#+INFOJS_OPT: toc:t ltoc:t
#+INFOJS_OPT: view:info mouse:underline buttons:nil

* 功能
* 配置
** org-bullets
   使org-mode更美观
   1. 改变 **为图标
   2. 改变省略号为⤵
* 使用
** 基本语法
*** 语法: time-stamp选择
    添加time-stamp时, 不要在calendar中移动,效率太低
    使用以下2种方式即可:
    1. 使用简约的时间格式
       17-1-1  => 2017-01-01
    2. 使用时间间隔
       now = [2016-12-28 Wed]
       +1d  => 2016-12-29

    具体见(dir) - Org mode - Dates and times - Creating timestamps - The date/time promt

*** 语法: 时间repeate
    org-mode repeate格式
    +   .+   ++区别

    1. "+"
       backlog 可以积压的item
    2. ".+"
       specific date, no backlog 在特定日期完成的item
       ep: call mother
       每周六给mother打电话, 不可积压(或者说现在的操作不会影响之前)
    3. "++"
       specific interval, no backlog 在特定间隔完成的item
       ep: change batteries
       每隔1月更换电池, 不可积压
*** 语法: table计算
    @ 表示行； $表示列
    < 表示第一;   > 表示最后；

    例子:
    @<  第一行
    $>  最后一列
    @<< 第二行(更建议使用 @2)

    对table使用C-c} 可以查看行列值
    
** 导出
   快捷键
   #+BEGIN_EXAMPLE
   C-c C-e
   #+END_EXAMPLE
** org-info.js
   输出info-style xhtml
   [[https://orgmode.org/worg/code/org-info-js/][官方文档]]
*** 模式
    - info
      'm' 切换
    - over view 
      'm' 切换
    - ppt 
      'x' 切换

*** 属性值说明
    - path     org-info.js脚本所在路径, 可以是绝对路径或相对路径, 但必须是目录
               如果没有设置, 则默认从orgmode.org中读取
	       publish , export均生效
    - home     整个org-file的根节点,  对应界面上的"HOME"按钮
      1) export 时候, 设置有效
      2) publish的时候, 设置无效
    - up       整个org-file的上层节点,对应界面上的"UP"按钮
      TODONOW 暂时不知道作用, 不设置正常使用, 界面上没有"UP"按钮
    - view     html显示样式
    - toc      整个org-file是否显示content
      publish时候 设置无效
    - ltoc     sub-heading是否显示content
      publish时候 设置无效
    - mouse    鼠标样式
    - buttons 
*** 快捷键
    | 快捷键 | 说明 |
    |--------+------|
    | n      |      |
    |--------+------|
    | p      |      |
    |--------+------|
    | m      |      |
    |--------+------|
    | x      |      |
    |--------+------|
    | i      |      |
    |--------+------|
    | ?      |      |
    |--------+------|

*** 安装
    org-mode自带, 无须额外安装
*** 使用
    1. org文件增加导出属性
       #+BEGIN_EXAMPLE
       #+INFOJS_OPT: home:http://wcq.fun
       #+INFOJS_OPT: view:info toc:t ltoc:t mouse:underline buttons:nil
       #+END_EXAMPLE

    2. org-export-html-to-html
*** 链接
    org-file中的连接会被自动转换为 html 比如:
    org-file中:
    #+BEGIN_EXAMPLE
    file:test.org
    #+END_EXAMPLE
    
    在export的html中, 会被自动转换为
    #+BEGIN_EXAMPLE
    link:test.html
    #+END_EXAMPLE
** MobileOrg
    方案流程
     1. PC端配置MobileOrg
       	具体见.emacs
     2. 寻找WebDAV server
       	现在使用的是坚果云
     3. curl同步PC端到webDAV server
       	这一块非常纠结
       	起初使用的ssh的scp,发现scp貌似不支持https?
       	后来使用了curl, 结果发现curl不支持目录的上传.....
       	导致.emacs中mobileorg的配置十分难看, 有机会应该改掉这块!
       	方法有2:
       	1) 换一种工具取代curl  -- 更倾向于这一种方式
       	2) 使用regular expression -- 貌似curl支持的不好


    总览图

     +-----------+ push	       	+--------------+
     | PC端      |-------------->| WwbDAV server|
     |           |<--------------|              |
     +-----------+ pull	       	+--------------+
       	       	       	       	       | 	  ^ |
       	       	       	       	       | 	    |
       	       	       	       	       | 	    |
				       v	  |
                                 +--------------+
 			       	 | Mobile       |
                                 |              |
                                 +--------------+
* org-mode与GTD
  [[file:emacs_GTD.org][org-mode与GTD]]
