content/org-info/emacs_com/emacs_org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 20:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-mode</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../emacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdf82359">1. 功能</a></li>
<li><a href="#org455ae04">2. 配置</a>
<ul>
<li><a href="#org88cf7ba">2.1. org-bullets</a></li>
</ul>
</li>
<li><a href="#org23d1439">3. 使用</a>
<ul>
<li><a href="#org5d3b127">3.1. 基本语法</a>
<ul>
<li><a href="#org5c01393">3.1.1. 语法: time-stamp选择</a></li>
<li><a href="#orge219239">3.1.2. 语法: 时间repeate</a></li>
<li><a href="#org8ff9cba">3.1.3. 语法: table计算</a></li>
</ul>
</li>
<li><a href="#orgef85ecc">3.2. 导出</a></li>
<li><a href="#orgc014603">3.3. org-info.js</a>
<ul>
<li><a href="#orge0005ca">3.3.1. 模式</a></li>
<li><a href="#orgb2fcf06">3.3.2. 属性值说明</a></li>
<li><a href="#orgc631717">3.3.3. 快捷键</a></li>
<li><a href="#org015bef8">3.3.4. 安装</a></li>
<li><a href="#orgd23820d">3.3.5. 使用</a></li>
<li><a href="#org18e2d2d">3.3.6. 链接</a></li>
</ul>
</li>
<li><a href="#orge578539">3.4. MobileOrg</a></li>
</ul>
</li>
<li><a href="#orgfc353cc">4. org-mode与GTD</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf82359" class="outline-2">
<h2 id="orgdf82359"><span class="section-number-2">1</span> 功能</h2>
</div>
<div id="outline-container-org455ae04" class="outline-2">
<h2 id="org455ae04"><span class="section-number-2">2</span> 配置</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org88cf7ba" class="outline-3">
<h3 id="org88cf7ba"><span class="section-number-3">2.1</span> org-bullets</h3>
<div class="outline-text-3" id="text-2-1">
<p>
使org-mode更美观
</p>
<ol class="org-ol">
<li>改变 **为图标</li>
<li>改变省略号为⤵</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org23d1439" class="outline-2">
<h2 id="org23d1439"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5d3b127" class="outline-3">
<h3 id="org5d3b127"><span class="section-number-3">3.1</span> 基本语法</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5c01393" class="outline-4">
<h4 id="org5c01393"><span class="section-number-4">3.1.1</span> 语法: time-stamp选择</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
添加time-stamp时, 不要在calendar中移动,效率太低
使用以下2种方式即可:
</p>
<ol class="org-ol">
<li>使用简约的时间格式
17-1-1  =&gt; 2017-01-01</li>
<li>使用时间间隔
now = <span class="timestamp-wrapper"><span class="timestamp">[2016-12-28 Wed]</span></span>
+1d  =&gt; 2016-12-29</li>
</ol>

<p>
具体见(dir) - Org mode - Dates and times - Creating timestamps - The date/time promt
</p>
</div>
</div>

<div id="outline-container-orge219239" class="outline-4">
<h4 id="orge219239"><span class="section-number-4">3.1.2</span> 语法: 时间repeate</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
org-mode repeate格式
</p>
<ul class="org-ul">
<li>.+   ++区别</li>

<li>"+"
backlog 可以积压的item</li>
<li>".+"
specific date, no backlog 在特定日期完成的item
ep: call mother
每周六给mother打电话, 不可积压(或者说现在的操作不会影响之前)</li>
<li>"++"
specific interval, no backlog 在特定间隔完成的item
ep: change batteries
每隔1月更换电池, 不可积压</li>
</ul>
</div>
</div>
<div id="outline-container-org8ff9cba" class="outline-4">
<h4 id="org8ff9cba"><span class="section-number-4">3.1.3</span> 语法: table计算</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
@ 表示行； $表示列
&lt; 表示第一;   &gt; 表示最后；
</p>

<p>
例子:
@&lt;  第一行
$&gt;  最后一列
@&lt;&lt; 第二行(更建议使用 @2)
</p>

<p>
对table使用C-c} 可以查看行列值
</p>
</div>
</div>
</div>

<div id="outline-container-orgef85ecc" class="outline-3">
<h3 id="orgef85ecc"><span class="section-number-3">3.2</span> 导出</h3>
<div class="outline-text-3" id="text-3-2">
<p>
快捷键
</p>
<pre class="example">
C-c C-e
</pre>
</div>
</div>
<div id="outline-container-orgc014603" class="outline-3">
<h3 id="orgc014603"><span class="section-number-3">3.3</span> org-info.js</h3>
<div class="outline-text-3" id="text-3-3">
<p>
输出info-style xhtml
<a href="https://orgmode.org/worg/code/org-info-js/">官方文档</a>
</p>
</div>
<div id="outline-container-orge0005ca" class="outline-4">
<h4 id="orge0005ca"><span class="section-number-4">3.3.1</span> 模式</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>info
'm' 切换</li>
<li>over view 
'm' 切换</li>
<li>ppt 
'x' 切换</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2fcf06" class="outline-4">
<h4 id="orgb2fcf06"><span class="section-number-4">3.3.2</span> 属性值说明</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>path     org-info.js脚本所在路径, 可以是绝对路径或相对路径, 但必须是目录
如果没有设置, 则默认从orgmode.org中读取
publish , export均生效</li>
<li>home     整个org-file的根节点,  对应界面上的"HOME"按钮
<ol class="org-ol">
<li>export 时候, 设置有效</li>
<li>publish的时候, 设置无效</li>
</ol></li>
<li>up       整个org-file的上层节点,对应界面上的"UP"按钮
TODONOW 暂时不知道作用, 不设置正常使用, 界面上没有"UP"按钮</li>
<li>view     html显示样式</li>
<li>toc      整个org-file是否显示content
publish时候 设置无效</li>
<li>ltoc     sub-heading是否显示content
publish时候 设置无效</li>
<li>mouse    鼠标样式</li>
<li>buttons</li>
</ul>
</div>
</div>
<div id="outline-container-orgc631717" class="outline-4">
<h4 id="orgc631717"><span class="section-number-4">3.3.3</span> 快捷键</h4>
<div class="outline-text-4" id="text-3-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">p</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">m</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">i</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org015bef8" class="outline-4">
<h4 id="org015bef8"><span class="section-number-4">3.3.4</span> 安装</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
org-mode自带, 无须额外安装
</p>
</div>
</div>
<div id="outline-container-orgd23820d" class="outline-4">
<h4 id="orgd23820d"><span class="section-number-4">3.3.5</span> 使用</h4>
<div class="outline-text-4" id="text-3-3-5">
<ol class="org-ol">
<li><p>
org文件增加导出属性
</p>
<pre class="example">
#+INFOJS_OPT: home:http://wcq.fun
#+INFOJS_OPT: view:info toc:t ltoc:t mouse:underline buttons:nil
</pre></li>

<li>org-export-html-to-html</li>
</ol>
</div>
</div>
<div id="outline-container-org18e2d2d" class="outline-4">
<h4 id="org18e2d2d"><span class="section-number-4">3.3.6</span> 链接</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
org-file中的连接会被自动转换为 html 比如:
org-file中:
</p>
<pre class="example">
file:test.org
</pre>

<p>
在export的html中, 会被自动转换为
</p>
<pre class="example">
link:test.html
</pre>
</div>
</div>
</div>
<div id="outline-container-orge578539" class="outline-3">
<h3 id="orge578539"><span class="section-number-3">3.4</span> MobileOrg</h3>
<div class="outline-text-3" id="text-3-4">
<p>
方案流程
</p>
<ol class="org-ol">
<li>PC端配置MobileOrg
具体见.emacs</li>
<li>寻找WebDAV server
现在使用的是坚果云</li>
<li>curl同步PC端到webDAV server
这一块非常纠结
起初使用的ssh的scp,发现scp貌似不支持https?
后来使用了curl, 结果发现curl不支持目录的上传&#x2026;..
导致.emacs中mobileorg的配置十分难看, 有机会应该改掉这块!
方法有2:
<ol class="org-ol">
<li>换一种工具取代curl  &#x2013; 更倾向于这一种方式</li>
<li>使用regular expression &#x2013; 貌似curl支持的不好</li>
</ol></li>
</ol>


<p>
总览图
</p>

<p>
<del>-----------</del> push	       	<del>--------------</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">PC端</td>
<td class="org-left">---------&#x2013;&#x2014;&gt;</td>
<td class="org-left">WwbDAV server</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;--------------</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del> pull	       	<del>--------------</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>

<tr>
</tr>
</tbody>
</table>
<p>
v	  |
</p>
<!-- This HTML table template is generated by emacs 26.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;Mobile&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
</div>
<div id="outline-container-orgfc353cc" class="outline-2">
<h2 id="orgfc353cc"><span class="section-number-2">4</span> org-mode与GTD</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="emacs_GTD.html">org-mode与GTD</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-09-27 Mon 20:17</p>
<p class="validation"></p>
</div>
</body>
</html>
